Revit 2024 API
FabricationPart.GetDimensions Method
 Gets all fabrication dimensions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public IList<FabricationDimensionDefinition> GetDimensions()
Visual Basic
Public Function GetDimensions As IList(Of FabricationDimensionDefinition)
Visual C++
public:
IList<FabricationDimensionDefinition^>^ GetDimensions()
Return Value
 Returns an array of fabrication dimensions.
See Also
FabricationPart Class
Autodesk.Revit.DB Namespace